In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [4]:
dataset = pd.read_csv("loan.csv")
dataset.head(3)

,UID,Marital_status,Dependents,Is_graduate,Income,Loan_amount,Term_months,Credit_score,approval_status,Age,Sex,Purpose,Hobby
0,LP001002,NO,0,Graduate,45848,NaN,360.0,1.0,0,40.0,Male,Education,Reading
1,LP001002,NO,0,Graduate,45848,NaN,360.0,1.0,0,40.0,Male,Education,Reading
2,LP001003,YES,1,Graduate,15325,128.0,360.0,1.0,1,22.0,Male,Education,Reading

In [5]:
dataset.isnull().sum()

UID                 0
Marital_status      2
Dependents         15
Is_graduate         2
Income              0
Loan_amount        23
Term_months        14
Credit_score       50
approval_status     0
Age                 6
Sex                13
Purpose             0
Hobby               0
dtype: int64

In [6]:
dataset.select_dtypes(include="float64").columns

Index(['Loan_amount', 'Term_months', 'Credit_score', 'Age'], dtype='object')